HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    front
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    back
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    porosityWall
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ************************************************************************* //
