HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

m4 system/blockMeshDict.m4 > system/blockMeshDict

runApplication blockMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
